In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [9]:
books=pd.read_csv(r"C:\Recommendation System\Books.csv\Books.csv")

In [6]:
ratings=pd.read_csv(r"C:\Recommendation System\Ratings.csv\Ratings.csv")

In [7]:
users=pd.read_csv(r"C:\Recommendation System\Users.csv\Users.csv")

In [10]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [11]:
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [12]:
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

Checking the columns present in our datasets

In [16]:
books.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L'],
      dtype='object')

In [22]:
ratings.columns

Index(['User-ID', 'ISBN', 'Book-Rating'], dtype='object')

In [23]:
users.columns

Index(['User-ID', 'Location', 'Age'], dtype='object')

Checking the rows and columns in each dataset

In [24]:
books.shape

(271360, 2)

In [25]:
ratings.shape

(1149780, 3)

In [26]:
users.shape

(278858, 3)

Checking is there any null value in dataset

In [27]:
books.isnull().sum()

ISBN          0
Book-Title    0
dtype: int64

In [29]:
ratings.isnull().sum()

User-ID        0
ISBN           0
Book-Rating    0
dtype: int64

In [31]:
users.isnull().sum()

User-ID          0
Location         0
Age         110762
dtype: int64

Checking is there any duplicated value in the datasets

In [32]:
books.duplicated().sum()

0

In [33]:
ratings.duplicated().sum()

0

In [34]:
users.duplicated().sum()

0

POPULARITY BASED FILTERING: 
Popularity-based filtering is a straightforward recommendation technique that suggests items based on their popularity rather than individual user preferences or interactions.

In [17]:
#droping the unecessary columns of Books_rating:
books.drop(['Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L'],axis=1,inplace=True)

 Merging books and ratings on the column ‘ISBN’,
and merging users and ratings on the column ‘USER-ID

In [18]:
book_ratings = books.merge(ratings ,on = 'ISBN')
user_rating = users.merge(ratings , on = 'User-ID')

In [19]:
book_ratings.head()

         ISBN           Book-Title  User-ID  Book-Rating
0  0195153448  Classical Mythology        2            0
1  0002005018         Clara Callan        8            5
2  0002005018         Clara Callan    11400            0
3  0002005018         Clara Callan    11676            8
4  0002005018         Clara Callan    41385            0

In [20]:
user_rating.head()

   User-ID                   Location   Age        ISBN  Book-Rating
0        2  stockton, california, usa  18.0  0195153448            0
1        7        washington, dc, usa   NaN   034542252            0
2        8   timmins, ontario, canada   NaN  0002005018            5
3        8   timmins, ontario, canada   NaN  0060973129            0
4        8   timmins, ontario, canada   NaN  0374157065            0

In [36]:
book_num_ratings = book_ratings.groupby('Book-Title')['Book-Rating'].count().reset_index().rename(columns = {'Book-Rating':'Num-Ratings' })
book_avg_ratings = book_ratings.groupby('Book-Title')['Book-Rating'].mean().reset_index().rename(columns = {'Book-Rating':'Avg-Ratings' })
final_rating = book_num_ratings.merge(book_avg_ratings , on = 'Book-Title')

In [37]:
#final_rating data frame is created by merging the two data frames book_avg_ratings and book_num_ratings
final_rating

,Book-Title,Num-Ratings,Avg-Ratings
0,A Light in the Storm: The Civil War Diary of ...,4,2.250000
1,Always Have Popsicles,1,0.000000
2,Apple Magic (The Collector's series),1,0.000000
3,"Ask Lily (Young Women of Faith: Lily Series, ...",1,8.000000
4,Beyond IBM: Leadership Marketing and Finance ...,1,0.000000
...,...,...,...
241066,Ã?Â?lpiraten.,2,0.000000
241067,Ã?Â?rger mit Produkt X. Roman.,4,5.250000
241068,Ã?Â?sterlich leben.,1,7.000000
241069,Ã?Â?stlich der Berge.,3,2.666667
241070,Ã?Â?thique en toc,2,4.000000

In [38]:
final_rating.head()

                                          Book-Title  Num-Ratings  Avg-Ratings
0   A Light in the Storm: The Civil War Diary of ...            4         2.25
1                              Always Have Popsicles            1         0.00
2               Apple Magic (The Collector's series)            1         0.00
3   Ask Lily (Young Women of Faith: Lily Series, ...            1         8.00
4   Beyond IBM: Leadership Marketing and Finance ...            1         0.00

Implementing popularity-based filtering, getting most voted books with no. of votes greater than or equal to 250

In [40]:
popular_books = final_rating[final_rating['Num-Ratings'] > 250].sort_values(by = 'Avg-Ratings'  , \
                                                                            ascending= False).reset_index(drop = True).head(50)
popular_books.head(10)

                                          Book-Title  Num-Ratings  Avg-Ratings
0  Harry Potter and the Prisoner of Azkaban (Book 3)          428     5.852804
1       Harry Potter and the Goblet of Fire (Book 4)          387     5.824289
2     Harry Potter and the Sorcerer's Stone (Book 1)          278     5.737410
3  Harry Potter and the Order of the Phoenix (Boo...          347     5.501441
4   Harry Potter and the Chamber of Secrets (Book 2)          556     5.183453
5  The Hobbit : The Enchanting Prelude to The Lor...          281     5.007117
6  The Fellowship of the Ring (The Lord of the Ri...          368     4.948370
7  Harry Potter and the Sorcerer's Stone (Harry P...          575     4.895652
8     The Two Towers (The Lord of the Rings, Part 2)          260     4.880769
9                              To Kill a Mockingbird          510     4.700000

COLLABORATIVE FILTERING:
Collaborative filtering is a popular technique used in recommendation systems to predict a user's interests by collecting preferences from many users. 

Types:
1) User-Based Collaborative Filtering:
In user-based collaborative filtering, the system makes recommendations based on the similarity between users. 
ex: Suppose users A and B have similar movie ratings. If user B likes a new movie that user A hasn't seen, it's likely that user A will also enjoy that movie.

2) Item-Based Collaborative Filtering:
Item-based collaborative filtering, on the other hand, focuses on the similarity between items rather than users. 
ex: If a user rates "Inception" highly, and "Interstellar" is highly similar to "Inception" based on other users' ratings, "Interstellar" might be recommended to the user.

To build a collaborative-filtering-based recommendation system, we will consider only those users who have rated more than 200 books and those books which are having at least 50 ratings.

In [41]:
x = book_ratings.groupby('User-ID').count()['Book-Rating'] > 200
educated_users  = x[x].index

In [42]:
book_ratings = book_ratings[book_ratings['User-ID'].isin(educated_users)]

In [43]:
y  = book_ratings.groupby('Book-Title')['Book-Rating'].count() >= 50
famous_books = y[y].index

In [44]:
final_rating = book_ratings[book_ratings['Book-Title'].isin(famous_books)]

In [46]:
# creating a pt (pivot table)
# Piot table: A pivot table is a data summarization tool 
# It allows users to summarize, analyze, 
# and explore data by organizing it into a table format that makes it easier to understand relationships, patterns, and trends.
pt = final_rating.pivot_table(index='Book-Title',columns='User-ID',values='Book-Rating')
pt.head()

User-ID,254,2276,2766,2977,3363,4017,4385,6251,6323,6543,...,271705,273979,274004,274061,274301,274308,275970,277427,277639,278418
Book-Title,,,,,,,,,,,,,,,,,,,,,
1984,9.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,10.0,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN
1st to Die: A Novel,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,9.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2nd Chance,NaN,10.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,...,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,0.0,NaN
4 Blondes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
A Bend in the Road,0.0,NaN,7.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

COSINE SIMILARITY:
Cosine similarity is a metric used to measure how similar two vectors are, regardless of their magnitude.

The formula for cosine similarity between two vectors 
𝐴 and 𝐵 is:

Cosine Similarity =  𝐴⋅𝐵 /  ∥𝐴∥∥𝐵∥

Calculating similarity score between each book, 
the similarity betwen 5 books with the highest similarity scores will be recommended as shown below.

In [48]:
# so many NANs, so filling these with '0'
pt.fillna(0,inplace=True)
pt.head()

User-ID,254,2276,2766,2977,3363,4017,4385,6251,6323,6543,...,271705,273979,274004,274061,274301,274308,275970,277427,277639,278418
Book-Title,,,,,,,,,,,,,,,,,,,,,
1984,9.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,10.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1st to Die: A Novel,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,9.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2nd Chance,0.0,10.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4 Blondes,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
A Bend in the Road,0.0,0.0,7.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [49]:
from sklearn.metrics.pairwise import cosine_similarity
similarity_scores = cosine_similarity(pt)
similarity_scores.shape

(706, 706)

In [53]:
def recommend(book_name):
    # fetch the index of the book from the pivot table
    index = np.where(pt.index==book_name)[0][0]
    
    similar_items = sorted(list(enumerate(similarity_scores[index])), # enumerate to get the distance with index
                           key=lambda x:x[1],  # key=lambda x:x[1] is used to sort the list of based on the similarity score, not on the basis of index                          
                             #reverse=True)[1:6] # reverse=True to get the similarity scores in descending order
                           reverse=True)[1:6]
    
    data = []
    for i in similar_items:
        item = []
        temp_df = books[books['Book-Title'] == pt.index[i[0]]] # pt.index[i[0]]] to get the index of the books
        item.extend(list(temp_df.drop_duplicates('Book-Title')['Book-Title'].values))
        
        data.append(item)
    
    return data

In [54]:
recommend('I Know This Much Is True')

[['Sea Glass: A Novel'],
 ['Blue Diary'],
 ["Where the Heart Is (Oprah's Book Club (Paperback))"],
 ['Saint Maybe'],
 ['Here on Earth']]

In [60]:
recommend('4 Blondes')

[['The House of the Spirits'],
 ['Pride and Prejudice'],
 ['Pleading Guilty'],
 ['Seabiscuit'],
 ['Notes from a Small Island']]